""" -------------------- """
    #Робота з функціями
""" -------------------- """
"""
Функція оголошується за допомогою ключового слова def. 
Після ключового слова вказується ім'я функції, за яким йде пара дужок (), 
у яких можна вказати імена деяких змінних, та двокрапка : в кінці рядка. 
Далі слідує блок команд, що складають функцію.
"""
def say_hello():
		# тіло функції
    print('Привіт, Світ!')

# Кінець функції say_hello()

# виклик функції
say_hello()

# ще один виклик функції
say_hello()
